app/views/users/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 3
---
        <ul class="user_page-contents">
          <% current_user.reviews.each do |review| %>