app/controllers/products_controller.rb

  def index
    @products = Product.order('open_date DESC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY open_date DESC LIMIT 20

  def show
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)
---
SELECT  `products`.* FROM `products` WHERE (title LIKE('%愛%')) LIMIT 20